Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog Events
The WpfShapeCatalog type exposes the following members.
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
WpfShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace